/* default name for first the mapping */
"(default)" = "(default)";

/* Magic string to trigger automatic mapping renames. It should look like an identifier rather than normal word, with the @ on the front. */
"@Application" = "@Application";

/* axis name */
"axis %d" = "Axis %d";

/* axis high trigger */
"axis high" = "High";

/* axis low trigger */
"axis low" = "Low";

/* button name */
"button %d" = "Button %d";

/* button to cancel import */
"cancel import" = "Cancel";

/* keyboard key */
"Caps Lock" = "Caps Lock";

/* menu item text to disable event simulation */
"Disable" = "Disable";

/* menu item text to enable event simulation */
"Enable" = "Enable";


/* toolbar button to start mapping */
"Start" = "Start";

/* toolbar button to stop mapping */
"Stop" = "Stop";

/* tooltip when mapping is off */
"start mapping tooltip" = "Start gamepad mapping — switch to your game after enabling";

/* tooltip when mapping is on */
"stop mapping tooltip" = "Stop gamepad mapping";

/* shown when user must enter a key code to map to */
"enter key code" = "Enter a key code (e.g. 0x2A)";

/* hat switch down state */
"hat down" = "Down";

/* hat switch left state */
"hat left" = "Left";

/* hat switch right state */
"hat right" = "Right";

/* hat switch name */
"hat switch %d" = "Hat Switch %d";

/* hat switch up state */
"hat up" = "Up";

/* button to merge imported mappings */
"import and merge" = "Merge";

/* Explanation of import conflict */
"import conflict in %@" = "This file contains inputs you've already mapped in \"%@\". Do you want to merge them and replace your existing mappings, or import this as a separate mapping?";

/* Title of import conflict alert */
"import conflict prompt" = "Replace existing mappings?";

/* button to import as new mapping */
"import new mapping" = "New Mapping";

/* keyboard key */
"Insert" = "Insert";

/* shown when the user types an invalid key code */
"invalid key code" = "Key codes must be small hexadecimal numbers (e.g. 0xA2)";

/* error when imported file was JSON but not a mapping */
"invalid mapping file" = "This isn't a valid mapping file.";

/* unknown key code */
"key 0x%x" = "Key 0x%x";

/* numeric pad key */
"Key Pad *" = "Key Pad *";

/* numeric pad key */
"Key Pad +" = "Key Pad +";

/* numeric pad key */
"Key Pad -" = "Key Pad -";

/* numeric pad key */
"Key Pad ." = "Key Pad .";

/* numeric pad key */
"Key Pad /" = "Key Pad /";

/* numeric pad key */
"Key Pad ," = "Key Pad ,";

/* numeric pad key */
"Key Pad 0" = "Key Pad 0";

/* numeric pad key */
"Key Pad 1" = "Key Pad 1";

/* numeric pad key */
"Key Pad 2" = "Key Pad 2";

/* numeric pad key */
"Key Pad 3" = "Key Pad 3";

/* numeric pad key */
"Key Pad 4" = "Key Pad 4";

/* numeric pad key */
"Key Pad 5" = "Key Pad 5";

/* numeric pad key */
"Key Pad 6" = "Key Pad 6";

/* numeric pad key */
"Key Pad 7" = "Key Pad 7";

/* numeric pad key */
"Key Pad 8" = "Key Pad 8";

/* numeric pad key */
"Key Pad 9" = "Key Pad 9";

/* numeric pad key */
"Key Pad =" = "Key Pad =";

/* keyboard key */
"Left ⌘" = "Left ⌘";

/* keyboard key */
"Left ⌃" = "Left ⌃";

/* keyboard key */
"Left ⌥" = "Left ⌥";

/* keyboard key */
"Left ⇧" = "Left ⇧";

/* menu item when mappings list overflows */
"mapping overflow %lu" = "(and %lu more…)";

/* keyboard key */
"Menu" = "Menu";

/* keyboard key */
"Right ⌘" = "Right ⌘";

/* keyboard key */
"Right ⌃" = "Right ⌃";

/* keyboard key */
"Right ⌥" = "Right ⌥";

/* keyboard key */
"Right ⇧" = "Right ⇧";

/* name for new mappings */
"Untitled" = "Untitled";

/* Accessibility permission alert title */
"Accessibility Permission Required" = "Accessibility Permission Required";

/* Accessibility permission alert message */
"Enjoyable needs Accessibility permission to simulate keyboard input.\n\nOpen System Settings → Privacy & Security → Accessibility, enable Enjoyable, then quit (⌘Q) and reopen.\n\nIf Enjoyable is already listed but mapping still fails, remove it from the list with −, add it again with +, then restart. This is often needed after reinstalling the app." = "Enjoyable needs Accessibility permission to simulate keyboard input.\n\nOpen System Settings → Privacy & Security → Accessibility, enable Enjoyable, then quit (⌘Q) and reopen.\n\nIf Enjoyable is already listed but mapping still fails, remove it from the list with −, add it again with +, then restart. This is often needed after reinstalling the app.";

"Open Settings" = "Open Settings";

"Later" = "Later";
